---
kind: method
id: M:Autodesk.Revit.DB.Structure.MemberForces.Dispose
source: html/0578de00-fdcd-0d97-3f81-dafb46c2404e.htm
---
# Autodesk.Revit.DB.Structure.MemberForces.Dispose Method

Releases all resources used by the MemberForces

## Syntax (C#)
```csharp
public void Dispose()
```